#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_project_service.service["compute.googleapis.com"]: Refreshing state... [id=practice-cicd-mtk/compute.googleapis.com]
google_project_service.service["containerregistry.googleapis.com"]: Refreshing state... [id=practice-cicd-mtk/containerregistry.googleapis.com]
google_project_service.service["run.googleapis.com"]: Refreshing state... [id=practice-cicd-mtk/run.googleapis.com]
google_compute_network.vpc_network: Refreshing state... [id=projects/practice-cicd-mtk/global/networks/cicd-network]
google_compute_firewall.develop: Refreshing state... [id=projects/practice-cicd-mtk/global/firewalls/ssh-firewall]
google_compute_firewall.frontend: Refreshing state... [id=projects/practice-cicd-mtk/global/firewalls/http-firewall]
google_compute_instance.nginx_instance: Refreshing state... [id=projects/practice-cicd-mtk/zones/us-central1-c/instances/reverse-proxy]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_compute_firewall.develop has been changed
  ~ resource "google_compute_firewall" "develop" {
        id                      = "projects/practice-cicd-mtk/global/firewalls/ssh-firewall"
        name                    = "ssh-firewall"
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # google_compute_firewall.frontend has been changed
  ~ resource "google_compute_firewall" "frontend" {
        id                      = "projects/practice-cicd-mtk/global/firewalls/http-firewall"
        name                    = "http-firewall"
      + source_service_accounts = []
      + source_tags             = []
      + target_service_accounts = []
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }
  # google_compute_instance.nginx_instance has been changed
  ~ resource "google_compute_instance" "nginx_instance" {
        id                   = "projects/practice-cicd-mtk/zones/us-central1-c/instances/reverse-proxy"
      + labels               = {}
      + metadata             = {}
        name                 = "reverse-proxy"
        tags                 = [
            "dev",
            "web",
        ]
        # (13 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_cloud_run_service.api-run will be created
  + resource "google_cloud_run_service" "api-run" {
      + id       = (known after apply)
      + location = "us-central1"
      + name     = "api-run"
      + project  = (known after apply)
      + status   = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = (known after apply)
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + template {

          + spec {
              + serving_state = (known after apply)

              + containers {
                  + image = "asia.gcr.io/practice-cicd-mtk/hello"

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "1024Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
        }
    }

  # google_project_iam_member.inference-invoker-iam will be created
  + resource "google_project_iam_member" "inference-invoker-iam" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = (known after apply)
      + role    = "roles/run.invoker"
    }

  # google_service_account.api-run-service-account will be created
  + resource "google_service_account" "api-run-service-account" {
      + account_id   = "api-run-service-account"
      + display_name = "Service Account for API Cloud Run"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + project_id     = "projects/practice-cicd-mtk"
  + project_number = "608639825831"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marltake, Action: `pull_request`, Working Directory: ``, Workflow: `terraform CI/CD`*